src/cf/DataProcessors/ПомощникЗаменыОКОФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<DataProcessor>
		<Properties>
			<Name>ПомощникЗаменыОКОФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаОбъектов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КодыОКОФ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код1994</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКОФ1994</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеГруппировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКОФ2014</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПообъектнаяНастройка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыОКОФПообъектно</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код1994</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>16</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКОФ2014</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектОС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодОС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИнвНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКОФ1994</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторОсновныхФондов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/ОбщероссийскийКлассификаторОсновныхФондов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ОбщероссийскийКлассификаторОсновныхФондов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтрольноеЧисло</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеГруппировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АмортизационнаяГруппа</Name>
					<Comment>Амортизационная группа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.АмортизационныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/ПомощникЗаменыОКОФ/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем ПараметрыОбработчикаОжидания, ФормаДлительнойОперации;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСоответсвиеКодов();
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
	//	Объект.Организация = ЗаполнениеРеквизитовОбъектов.ОрганизацияПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("Обработка.ПомощникЗаменыОКОФ.Форма.ФормаПообъектнойНастройки") Тогда
		
		ДанныеТекСтроки = Элементы.КодыОКОФ.ТекущиеДанные;
		
		ДанныеТекСтроки.ПообъектнаяНастройка = ВыбранноеЗначение.Количество() > 0;
		ДанныеТекСтроки.Отметка = ВыбранноеЗначение.Количество() > 0 ИЛИ ЗначениеЗаполнено(ДанныеТекСтроки.ОКОФ2014);
		
		СтруктураПоиска = Новый Структура("Код1994", ДанныеТекСтроки.Код1994);
		
		МассивВыбранных = Объект.КодыОКОФПообъектно.НайтиСтроки(СтруктураПоиска);
		
		Для Каждого Стр Из МассивВыбранных Цикл
			Объект.КодыОКОФПообъектно.Удалить(Стр);
		КонецЦикла;	
		
		Для Каждого Стр Из ВыбранноеЗначение Цикл
			НовСтр = Объект.КодыОКОФПообъектно.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
		КонецЦикла	
		
	КонецЕсли;
	

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Если Объект.КодыОКОФ.Количество() > 0 Тогда
		 Объект.КодыОКОФ.Очистить();
	КонецЕсли;	 
		
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбъектовПриИзменении(Элемент)
	
	Если Объект.КодыОКОФ.Количество() > 0 Тогда
		 Объект.КодыОКОФ.Очистить();
	 КонецЕсли;
	 
КонецПроцедуры

&НаКлиенте
Процедура КодыОКОФОтметкаПриИзменении(Элемент)
	
	ДанныеТекСтроки = Элементы.КодыОКОФ.ТекущиеДанные;

	Если ДанныеТекСтроки.Отметка Тогда
		
		ДанныеТекСтроки.Отметка = ДанныеТекСтроки.ПообъектнаяНастройка ИЛИ ЗначениеЗаполнено(ДанныеТекСтроки.ОКОФ2014);
		
	ИначеЕсли ДанныеТекСтроки.ПообъектнаяНастройка Тогда
		
		 ДанныеТекСтроки.Отметка = Истина;
		 
	КонецЕсли;	 
		
КонецПроцедуры

&НаКлиенте
Процедура КодыОКОФОКОФ2014ПриИзменении(Элемент)
	
	ДанныеТекСтроки = Элементы.КодыОКОФ.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ДанныеТекСтроки.ОКОФ2014) И НЕ ДанныеТекСтроки.Отметка Тогда
		ДанныеТекСтроки.Отметка = Истина;
	ИначеЕсли НЕ (ДанныеТекСтроки.ПообъектнаяНастройка ИЛИ ЗначениеЗаполнено(ДанныеТекСтроки.ОКОФ2014)) И ДанныеТекСтроки.Отметка Тогда
		ДанныеТекСтроки.Отметка = Ложь;
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КодыОКОФЗаполнить(Команда)
	
	ПодготовитьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КодыОКОФЗаменить(Команда)
	
	ВыполнитьЗаменуКодов()
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПообъектно(Команда)
	
	ДанныеТекСтроки = Элементы.КодыОКОФ.ТекущиеДанные;
	
	Если ДанныеТекСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;	

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Код1994", ДанныеТекСтроки.Код1994);
	ПараметрыОтбора.Вставить("Наименование1994", ДанныеТекСтроки.НаименованиеГруппировки);
	ПараметрыОтбора.Вставить("ОКОФ2014", ДанныеТекСтроки.ОКОФ2014);
	ПараметрыОтбора.Вставить("Организация", Объект.Организация);
	ПараметрыОтбора.Вставить("ГруппаОбъектов", Объект.ГруппаОбъектов);
	ПараметрыОтбора.Вставить("КодыОКОФПообъектно", Объект.КодыОКОФПообъектно);
	
	ОткрытьФорму("Обработка.ПомощникЗаменыОКОФ.Форма.ФормаПообъектнойНастройки", ПараметрыОтбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Команда)
	
	Для Каждого Стр Из Объект.КодыОКОФ Цикл
		
		Стр.Отметка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	Для Каждого Стр Из Объект.КодыОКОФ Цикл
		
		Стр.Отметка = Ложь;
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыполнитьЗаменуКодов()
	
	Результат = Ложь;
	ИзмененоОбъектов = 0;
	
	ЗаданиеВыполнено = ВыполнитьЗаменуКодовОКОФ();
	
	Если ЗаданиеВыполнено Тогда
		
		//ПоказатьПредупреждение(Новый ОписаниеОповещения("ОбновитьДанныеПослеЗагрузки", ЭтотОбъект), НСтр("ru = 'Замена кодов завершена. Подробности - в журнале регистрации'"));
		Возврат;
		
	КонецЕсли;
	
	////ПараметрыОбработчикаОжидания = Новый Структура(
	////"МинимальныйИнтервал,
	////|МаксимальныйИнтервал,
	////|ТекущийИнтервал,
	////|КоэффициентУвеличенияИнтервала", 
	////1, 15, 1, 1.4);
	////ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
	////ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация",
	////Новый Структура("ИдентификаторЗадания", ИдентификаторЗадания), ЭтотОбъект);
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьДанныеПослеЗагрузки(Параметр) Экспорт 
	
	ПодготовитьДанныеНаСервере();

КонецПроцедуры	
	
&НаСервере

Процедура ВыполнитьЗаменуОКОФ(Параметры) Экспорт
	
	ТаблицаКодов = Параметры.ТаблицаКодов;
	ТаблицаКодовПообъектно = Параметры.ТаблицаКодовПообъектно;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СоответствиеКодов.Код1994,
	|	СоответствиеКодов.ОКОФ2014 КАК ОКОФ2014,
	|	СоответствиеКодов.ОКОФ1994 КАК ОКОФ1994
	|ПОМЕСТИТЬ СоответствиеКодов
	|ИЗ
	|	&СоответствиеКодов КАК СоответствиеКодов
	|ГДЕ
	|	НЕ СоответствиеКодов.ПообъектнаяНастройка
	|	И СоответствиеКодов.Отметка
	|	И НЕ СоответствиеКодов.ОКОФ2014 = ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокОбъектов.ОбъектОС,
	|	СписокОбъектов.ОКОФ2014 КАК ОКОФ2014,
	|	СписокОбъектов.ОКОФ1994 КАК ОКОФ1994,
	|	СписокОбъектов.Код1994 КАК Код1994
	|ПОМЕСТИТЬ ОбъектыДляИзменения
	|ИЗ
	|	&ТаблицаКодовПообъектно КАК СписокОбъектов
	|ГДЕ
	|	НЕ СписокОбъектов.ОКОФ2014 = ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка)
	|	И НЕ СписокОбъектов.ОбъектОС = ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОсновныеСредства.Ссылка,
	|	ОбщероссийскийКлассификаторОсновныхФондов.Ссылка КАК ОКОФ2014,
	|	ОбщероссийскийКлассификаторОсновныхФондов.Код КАК Код2014,
	|	СоответствиеКодов.Код1994 КАК КодОК01394,
	|	СоответствиеКодов.ОКОФ1994 КАК ОКОФ1994
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеКодов КАК СоответствиеКодов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбщероссийскийКлассификаторОсновныхФондов КАК ОбщероссийскийКлассификаторОсновныхФондов
	|			ПО СоответствиеКодов.ОКОФ2014 = ОбщероссийскийКлассификаторОсновныхФондов.Ссылка
	|		ПО ОсновныеСредства.КодПоОКОФ.Код = СоответствиеКодов.Код1994
	|ГДЕ
	|	ОсновныеСредства.КодПоОКОФ.Код В
	|			(ВЫБРАТЬ
	|				СоответствиеКодов.Код1994
	|			ИЗ
	|				СоответствиеКодов КАК СоответствиеКодов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СписокОбъектов.ОбъектОС,
	|	ОбщероссийскийКлассификаторОсновныхФондов.Ссылка,
	|	ОбщероссийскийКлассификаторОсновныхФондов.Код,
	|	СписокОбъектов.Код1994,
	|	СписокОбъектов.ОКОФ1994
	|ИЗ
	|	ОбъектыДляИзменения КАК СписокОбъектов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбщероссийскийКлассификаторОсновныхФондов КАК ОбщероссийскийКлассификаторОсновныхФондов
	|		ПО СписокОбъектов.ОКОФ2014 = ОбщероссийскийКлассификаторОсновныхФондов.Ссылка");

	Запрос.УстановитьПараметр("СоответствиеКодов", ТаблицаКодов);
	Запрос.УстановитьПараметр("ТаблицаКодовПообъектно", ТаблицаКодовПообъектно);

	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборОС = СхемаЗапроса.ПакетЗапросов[2].Операторы[0].Отбор;

	Если ЗначениеЗаполнено(Параметры.Организация) Тогда
		
		ТекстУсловия = "ОсновныеСредства.Организация = &Организация"; 
		ОтборОС.Добавить(ТекстУсловия);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Параметры.ГруппаОбъектов) Тогда
		
		ТекстУсловия = "ОсновныеСредства.Ссылка В ИЕРАРХИИ(&ГруппаОбъектов)"; 
		ОтборОС.Добавить(ТекстУсловия);
		Запрос.УстановитьПараметр("ГруппаОбъектов", Параметры.ГруппаОбъектов);
		
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
 
	Выборка = Запрос.Выполнить().Выбрать();
	
	Попытка 
		
		НачатьТранзакцию();
		
		Пока Выборка.Следующий() Цикл
			
			ЭлементОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЭлементОбъект.КодПоОКОФ 	= Выборка.ОКОФ2014;
			ЭлементОбъект.КодПоОК0Ф1994 	= Выборка.ОКОФ1994;
			ЭлементОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
	КонецПопытки
	
КонецПроцедуры	


Функция ВыполнитьЗаменуКодовОКОФ()
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("ТаблицаКодов", 			Объект.КодыОКОФ.Выгрузить());
	ПараметрыОбработки.Вставить("ТаблицаКодовПообъектно", 	Объект.КодыОКОФПообъектно.Выгрузить());
	ПараметрыОбработки.Вставить("Организация", 				Объект.Организация);
	ПараметрыОбработки.Вставить("ГруппаОбъектов", 			Объект.ГруппаОбъектов);
	
	
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	ЗаданиеВыполнено = Ложь;	

	НаименованиеЗадания = НСтр("ru = 'Замена кодов ОКОФ'");
		
	//ПараметрыЭкспортнойПроцедуры = Новый Массив;
	//ПараметрыЭкспортнойПроцедуры.Добавить(ПараметрыОбработки);
	//ПараметрыЭкспортнойПроцедуры.Добавить(АдресХранилища);
	//
	//Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
	//	ВремяОжидания = 4;
	//Иначе
	//	ВремяОжидания = 2;
	//КонецЕсли;
	
		
	ВыполнитьЗаменуОКОФ(ПараметрыОбработки);
	//Попытка
	//	Задание.ОжидатьЗавершения(ВремяОжидания);
	//Исключение		
	//	// Специальная обработка не требуется. Предположительно, исключение вызвано истечением времени ожидания.
	//КонецПопытки;
	//	
	//ИдентификаторЗадания = Задание.УникальныйИдентификатор;
	//
	//Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда
		ЗаданиеВыполнено = Истина; 
	//КонецЕсли;	
	
	Возврат ЗаданиеВыполнено;
	
КонецФункции	

//&НаКлиенте
//Процедура Подключаемый_ПроверитьВыполнениеЗадания()
//	
//	Попытка
//		Если ПроверитьВыполнениеФоновогоЗаданияНаСервере(ИдентификаторЗадания) Тогда
//			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
//			
//			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Замена кодов завершена. Подробности - в журнале регистрации'"));
//			Возврат;
//			
//		КонецЕсли;

//	Исключение
//		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
//		ВызватьИсключение;
//	КонецПопытки;
//	
//	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
//	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
//		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
//	КонецЕсли;
//	ПодключитьОбработчикОжидания(
//		"Подключаемый_ПроверитьВыполнениеЗадания", 
//		ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
//		Истина);
//		
//КонецПроцедуры

//&НаСервереБезКонтекста
//Функция ПроверитьВыполнениеФоновогоЗаданияНаСервере(ФоновоеЗаданиеИдентификатор)
//	Возврат ДлительныеОперации.ЗаданиеВыполнено(ФоновоеЗаданиеИдентификатор);
//КонецФункции

&НаСервере
Процедура ЗаполнитьСоответсвиеКодов()

	Чтение = Новый ЧтениеXML;
	Чтение.УстановитьСтроку(Обработки.ПомощникЗаменыОКОФ.ПолучитьМакет("СоответствиеОКОФ").ПолучитьТекст());

	// Прочитаем первый узел и проверим его
	Если Не Чтение.Прочитать() Тогда
		ВызватьИсключение("Пустой XML");
	ИначеЕсли Чтение.Имя <> "Items" Тогда
		ВызватьИсключение("Ошибка в структуре XML");
	КонецЕсли;
	
	Пока Чтение.Прочитать() Цикл
		
		Если Чтение.ТипУзла <> ТипУзлаXML.НачалоЭлемента Тогда
			Продолжить;
		ИначеЕсли Чтение.Имя <> "Item" Тогда
			ВызватьИсключение("Ошибка в структуре XML");
		КонецЕсли;
		
		НовСтр = СоответствиеКодов.Добавить();
		
		НовСтр.Код1994 						= Чтение.ПолучитьАтрибут("Код1994");
		НовСтр.Код2014 						= Чтение.ПолучитьАтрибут("Код2014");
		НовСтр.Код1994БезПробелов 			= Чтение.ПолучитьАтрибут("Код1994БезПробелов");
		НовСтр.НаименованиеГруппировки1994 	= Чтение.ПолучитьАтрибут("Наименование1994");

	КонецЦикла;

КонецПроцедуры	

&НаСервере
Процедура ПодготовитьДанныеНаСервере() 
	
		
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОсновныеСредства.КодПоОКОФ.Код КАК КодПоОКОФ
	|ПОМЕСТИТЬ ИспользуемыеОКОФ
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|ГДЕ
	|	НЕ ОсновныеСредства.КодПоОКОФ.Код = """"
	|	И НЕ ОсновныеСредства.КодПоОКОФ.Код ПОДОБНО ""[0-9][0-9][0-9][.]%""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СоответствиеКодов.Код1994,
	|	СоответствиеКодов.Код2014,
	|	СоответствиеКодов.Код1994БезПробелов,
	|	СоответствиеКодов.НаименованиеГруппировки1994
	|ПОМЕСТИТЬ СоответствиеКодов
	|ИЗ
	|	&СоответствиеКодов КАК СоответствиеКодов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИспользуемыеОКОФ.КодПоОКОФ КАК Код1994,
	|	ОбщероссийскийКлассификаторОсновныхФондов.Ссылка КАК ОКОФ1994,
	|	ВЫБОР
	|		КОГДА ОбщероссийскийКлассификаторОсновныхФондов.Ссылка ЕСТЬ NULL 
	|				ИЛИ ОбщероссийскийКлассификаторОсновныхФондов.Ссылка = ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка)
	|			ТОГДА СоответствиеКодов.НаименованиеГруппировки1994
	|		ИНАЧЕ ОбщероссийскийКлассификаторОсновныхФондов.НаименованиеГруппировки
	|	КОНЕЦ КАК НаименованиеГруппировки,
	|	СоответствиеКодов.Код2014 КАК Код2014,
	|	ОбщероссийскийКлассификаторОсновныхФондовНовый.Ссылка КАК ОКОФ2014,
	|	ВЫБОР
	|		КОГДА ОбщероссийскийКлассификаторОсновныхФондовНовый.Ссылка ЕСТЬ NULL 
	|				ИЛИ ОбщероссийскийКлассификаторОсновныхФондовНовый.Ссылка = ЗНАЧЕНИЕ(Справочник.ОбщероссийскийКлассификаторОсновныхФондов.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК Отметка
	|ИЗ
	|	ИспользуемыеОКОФ КАК ИспользуемыеОКОФ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбщероссийскийКлассификаторОсновныхФондов КАК ОбщероссийскийКлассификаторОсновныхФондов
	|		ПО ИспользуемыеОКОФ.КодПоОКОФ = ОбщероссийскийКлассификаторОсновныхФондов.Код
	|		ЛЕВОЕ СОЕДИНЕНИЕ СоответствиеКодов КАК СоответствиеКодов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбщероссийскийКлассификаторОсновныхФондов КАК ОбщероссийскийКлассификаторОсновныхФондовНовый
	|			ПО СоответствиеКодов.Код2014 = ОбщероссийскийКлассификаторОсновныхФондовНовый.Код
	|		ПО (ИспользуемыеОКОФ.КодПоОКОФ = СоответствиеКодов.Код1994
	|				ИЛИ ИспользуемыеОКОФ.КодПоОКОФ = СоответствиеКодов.Код1994БезПробелов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Код1994");
	
	
	Запрос.УстановитьПараметр("СоответствиеКодов", СоответствиеКодов.Выгрузить());
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(Запрос.Текст);
	ОтборОС = СхемаЗапроса.ПакетЗапросов[0].Операторы[0].Отбор;

	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		
		ТекстУсловия = "ОсновныеСредства.Организация = &Организация"; 
		ОтборОС.Добавить(ТекстУсловия);
		Запрос.УстановитьПараметр("Организация", Объект.Организация);
		
	КонецЕсли;
		
	Если ЗначениеЗаполнено(Объект.ГруппаОбъектов) Тогда
		
		ТекстУсловия = "ОсновныеСредства.Ссылка В ИЕРАРХИИ(&ГруппаОбъектов)"; 
		ОтборОС.Добавить(ТекстУсловия);
		Запрос.УстановитьПараметр("ГруппаОбъектов", Объект.ГруппаОбъектов);
		
	КонецЕсли;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
			
	Объект.КодыОКОФ.Загрузить(Запрос.Выполнить().Выгрузить());
		
	
КонецПроцедуры

#КонецОбласти
